import * as React from 'react';
import Accordion from '@mui/material/Accordion';
import AccordionDetails from '@mui/material/AccordionDetails';
import AccordionSummary from '@mui/material/AccordionSummary';
import Typography from '@mui/material/Typography';
import ExpandMoreIcon from '@mui/icons-material/ExpandMore';

export default function ControlledAccordions() {
  const [expanded, setExpanded] = React.useState(false);

  const handleChange = (panel) => (event, isExpanded) => {
    setExpanded(isExpanded ? panel : false);
  };

  return (
    
      <div style={{ marginLeft:1,marginRight:1 }} >
      <Accordion  expanded={expanded === 'panel1'} onChange={handleChange('panel1')}>
        <AccordionSummary
          expandIcon={<ExpandMoreIcon />}
          aria-controls="panel1bh-content"
          id="panel1bh-header"
        >
          <Typography sx={{ width: '33%', flexShrink: 0 }}>
            Педагог
          </Typography>
          <Typography sx={{ lineHeight:1,flexShrink: 1,
   color: 'blue'}}>
          
          <>Предмет 35 из 70 /</>
          <> Педагогика 9 из 30</>
          
          </Typography>
        </AccordionSummary>
        <AccordionDetails>
          <Typography>
           <p>-тиісті бейіні бойынша педагогикалық немесе өзге де кәсіптік білімі бар немесе қайта даярлау курстарынан өткен, 
             педагогикалық қызметке алғаш рет кіріскен, Ұлттық біліктілік тестілеуінен табысты өткен, сондай-ақ мынадай 
             кәсіби құзыреттерге сәйкес келетін адамдар: 
           </p> 
           <p>-оқу пәнінің, оқу-тәрбие процесінің, оқыту және бағалау әдістемесінің мазмұнын біледі; білім алушылардың психологиялық-жас 
             ерекшеліктерін ескере отырып, оқу-тәрбие процесін жоспарлайды және ұйымдастырады, білім алушының жалпы мәдениетін қалыптастыруға 
             және оны әлеуметтендіруге ықпал етеді, білім беру ұйымы деңгейіндегі іс-шараларға қатысады, білім алушылардың қажеттіліктерін ескере отырып, 
             тәрбиелеу мен оқытуда жеке тәсілді жүзеге асырады, кәсіби-педагогикалық диалог дағдыларын меңгерген, цифрлық білім беру ресурстарын қолданады; 
           </p> 
           <p>«Педагогикалық этиканың кейбір мәселелері туралы» Қазақстан Республикасы Білім және ғылым министрінің 2020 жылғы 11 мамырдағы № 190 бұйрығына 
             (Нормативтік құқықтық актілерді мемлекеттік тіркеу тізілімінде № 20619 болып тіркелген) сәйкес педагогикалық этиканың негізгі нормаларын сақтайды.
           </p>
          
          </Typography>
        </AccordionDetails>
      </Accordion>
      <Accordion expanded={expanded === 'panel2'} onChange={handleChange('panel2')}>
        <AccordionSummary
          expandIcon={<ExpandMoreIcon />}
          aria-controls="panel2bh-content"
          id="panel2bh-header"
        >
          <Typography sx={{ width: '33%', flexShrink: 0 }}>Педагог-модератор</Typography>
          <Typography sx={{ lineHeight:1,flexShrink: 1,
   color: 'blue'}}>
          
          <>Предмет 42 из 70 /</>
          <> Педагогика 12 из 30</>
          </Typography>
        </AccordionSummary>
        <AccordionDetails>
          <Typography>
            <p>тиісті бейіні бойынша педагогикалық немесе өзге де кәсіптік білімі бар адамдар, сондай-ақ қайта даярлау курстарынан өткен адамдар, 
              мынадай кәсіби құзыреттерге сәйкес келетін кемінде екі жыл педагогикалық өтілі бар адамдар: 
            </p>
            <p>«педагог» біліктілік санатының жалпы талаптарына сәйкес келеді, бұдан басқа:
            оқытудың инновациялық нысандарын, әдістері мен құралдарын қолданады; 
            кәсіби шеберлік конкурсының қатысушысы немесе жүлдегері немесе жеңімпазы болып табылады немесе білім беру саласындағы уәкілетті 
            орган бекіткен тізбеге сәйкес білім беру ұйымының, ауданның (облыстық маңызы бар қаланың) деңгейінде олимпиадаларға, конкурстарға, 
            жарыстарға қатысушы немесе жүлдегер немесе жеңімпаз оқушылары бар.
            </p>
          </Typography>
        </AccordionDetails>
      </Accordion>
      <Accordion expanded={expanded === 'panel3'} onChange={handleChange('panel3')}>
        <AccordionSummary
          expandIcon={<ExpandMoreIcon />}
          aria-controls="panel3bh-content"
          id="panel3bh-header"
        >
          <Typography sx={{ width: '33%', flexShrink: 0 }}>
            Педагог-эксперт
          </Typography>
          <Typography sx={{ lineHeight:1,flexShrink: 1,
   color: 'blue'}}>
          
          <>Предмет 49 из 70 /</>
          <> Педагогика 15 из 30</>
          </Typography>
        </AccordionSummary>
        <AccordionDetails>
          <Typography>
            <p>тиісті бейіні бойынша педагогикалық немесе өзге де кәсіптік білімі бар адамдар, сондай-ақ қайта 
              даярлау курстарынан өткен адамдар, мынадай кәсіби құзыреттерге сәйкес келетін, кемінде үш жыл 
              педагогикалық өтілі бар адамдар:
            </p>
            <p>
            «педагог-модератор» біліктілік санатының жалпы талаптарына сәйкес келеді, бұдан басқа:
            ұйымдастырылған оқу қызметін, оқу-тәрбие процесін талдау дағдыларын меңгерген;
            өзінің және білім беру ұйымы деңгейінде әріптестерінің кәсіби даму басымдықтарын конструктивті анықтайды; 
            кәсіби шеберлік конкурсының қатысушысы немесе жүлдегері немесе жеңімпазы болып табылады немесе білім беру 
            саласындағы уәкілетті орган бекіткен тізбеге сәйкес аудан (облыстық маңызы бар қала) деңгейінде 
            олимпиадаларға, конкурстарға, жарыстарға, облыс деңгейінде конкурстарға, жарыстарға қатысушы немесе 
            жүлдегер немесе жеңімпаз оқушылары бар;
            облыс, ел телевидениеде трансляциялауға енгізілген бейне -, телесабақтар дайындады (болған жағдайда) 
            </p>
          </Typography>
        </AccordionDetails>
      </Accordion>
      <Accordion expanded={expanded === 'panel4'} onChange={handleChange('panel4')}>
        <AccordionSummary
          expandIcon={<ExpandMoreIcon />}
          aria-controls="panel4bh-content"
          id="panel4bh-header"
        >
          <Typography sx={{ width: '33%', flexShrink: 0 }}>Педагог-исследователь</Typography>
          <Typography sx={{ lineHeight:1,flexShrink: 1,
   color: 'blue'}}>
          
          <>Предмет 56 из 70 /</>
          <> Педагогика 18 из 30</>
          </Typography>
        </AccordionSummary>
        <AccordionDetails>
          <Typography>
            <p>тиісті бейіні бойынша жоғары немесе жоғары оқу орнынан кейінгі педагогикалық немесе өзге 
              де кәсіптік білімі, мынадай кәсіби құзыреттерге сәйкес келетін, кемінде бес жыл педагогикалық өтілі бар адамдар: 
            </p>
            <p>сабақты зерттеу және бағалау құралдарын әзірлеу дағдыларын меңгерген;</p>
            <p>білім алушылардың зерттеушілік дағдыларын дамытуды қамтамасыз етеді; </p>
            <p>оқушылардың зерттеу дағдыларын дамытуды қамтамасыз етеді;</p>
            <p>облыс, республикалық маңызы бар қалалар және астана, республика деңгейінде тәжірибені 
              жинақтайды (республикалық ведомстволық бағынысты ұйымдар мен салалық мемлекеттік органдардың 
              білім беру ұйымдары үшін); </p>
            <p>кәсіби шеберлік конкурсының қатысушысы немесе жүлдегері немесе жеңімпазы болып табылады немесе білім беру 
              саласындағы уәкілетті орган бекіткен тізбеге сәйкес облыстық, республикалық, халықаралық деңгейлерде 
              олимпиадаларға, конкурстарға, жарыстарға қатысушы немесе жүлдегер немесе жеңімпаз оқушылары бар;</p>
            <p>«Қазақстан мұғалімі» ұлттық сыйлығының қатысушысы немесе жүлдегері немесе жеңімпазы, «Үздік педагог» 
              атағының иегері (болған жағдайда) болып табылады;</p>
          </Typography>
        </AccordionDetails>
      </Accordion>
      <Accordion expanded={expanded === 'panel5'} onChange={handleChange('panel5')}>
        <AccordionSummary
          expandIcon={<ExpandMoreIcon />}
          aria-controls="panel4bh-content"
          id="panel4bh-header"
        >
          <Typography sx={{ width: '33%', flexShrink: 0 }}>Педагог-мастер</Typography>
          <Typography sx={{ lineHeight:1,flexShrink: 1,
   color: 'blue'}}>
          
          <>Предмет 63 из 70 /</>
          <> Педагогика 21 из 30</>
          </Typography>
        </AccordionSummary>
        <AccordionDetails>
          <Typography>
           <p>тиісті бейіні бойынша жоғары немесе жоғары оқу орнынан кейінгі педагогикалық білімі, келесі кәсіби құзыреттерге 
             сәйкес келетін кемінде алты жыл педагогикалық өтілі бар адамдар: </p>
           <p>«педагог-зерттеуші» біліктілік санатының жалпы талаптарына сәйкес келеді, бұдан басқа:</p>
           <p>Ы.Алтынсарин атындағы Ұлттық білім академиясы жанындағы Республикалық оқу-әдістемелік кеңесте немесе 
             Техникалық және кәсіптік білім департаменті жанындағы Республикалық оқу-әдістемелік кеңесте мақұлданған авторлық 
             бағдарламасы бар немесе білім беру саласындағы уәкілетті орган бекіткен немесе Техникалық және кәсіптік білім 
             департаменті жанындағы Республикалық оқу-әдістемелік кеңес ұсынған оқулықтардың, оқу-әдістемелік кешендер мен 
             оқу-әдістемелік құралдардың тізбесіне енгізілген басып шығарылған оқулықтардың, оқу-әдістемелік кешендердің 
             авторы (бірлескен авторы) болып табылады немесе тест тапсырмаларын, оқулықтарды, оқу-әдістемелік кешендерді 
             сараптау жөніндегі сарапшылар құрамына кіреді немесе уорлд скилс (WorldSkill) (кәсіби шеберлік конкурсы) 
             чемпионаттарының сарапшысы немесе педагогтердің біліктілігін арттыру бойынша тренер болып табылатын адамдар;</p>
           <p>республикалық немесе халықаралық кәсіби конкурстардың жүлдегері немесе жеңімпазы болып табылады немесе білім 
             беру саласындағы уәкілетті орган бекіткен тізбеге сәйкес республикалық немесе халықаралық деңгейлердегі 
             олимпиадалардың, конкурстардың, жарыстардың жүлдегерлерін немесе жеңімпаздарын дайындаған;</p>
           
          </Typography>
        </AccordionDetails>
      </Accordion>
    </div>

    

    
  );
}
